var provinceArray = new Array("请选择","北京","天津","上海");
//first index
// 1:北京              2：天津             3 上海
// second index
// 目前均为0
var cityArray = new Array();
cityArray[0] = new Array("请选择");
cityArray[1] = new Array("请选择","北京市");
cityArray[2] = new Array("请选择","天津市");
cityArray[3] = new Array("请选择","上海市");
var distArray = new Array();
distArray[0] = new Array();
distArray[1] = new Array();
distArray[2] = new Array();
distArray[3] = new Array();
distArray[0][0] = new Array("请选择");
distArray[1][0] = new Array("请选择");
distArray[1][1] = new Array("请选择","海淀区","西城区","朝阳区","平谷区","昌平区",
"大兴区","房山区","密云区");
distArray[2][0] = new Array("请选择");
distArray[2][1] = new Array("请选择","和平区","河东区","河西区","南开区","河北区",
"滨海新区","东丽区","红桥区");
distArray[3][0] = new Array("请选择");
distArray[3][1] = new Array("请选择","黄埔区","徐汇区","长宁区","静安区","普陀区",
"虹口区","浦东新区","闵行区");
var townArray = new Array();
for(var i = 0 ;i<4;i++){
    townArray[i] = new Array();
    for(var j = 0;j <2;j++){
        townArray[i][j] = new Array();
    }
}
townArray[0][0][0] = new Array("请选择");
//district of Beijing
townArray[1][0][0] = new Array("请选择");
townArray[1][1][0] = new Array("请选择");
townArray[1][1][1] = new Array("请选择","北太平庄","学院路","中关村","上地",
"清华园","北下关","西二旗","青龙镇","七侠镇","花园路","香山");//海淀区
townArray[1][1][2] = new Array("请选择","西长安街","金融街","广安门内","德胜门",
"月坛","展览路","天桥","什刹海","陶然亭","新街口","大栅栏");//西城区
townArray[1][1][3] = new Array("请选择","和平街","八里庄","十八里堡","六里屯",
"左家庄","望京街道","亚运村","高碑店区","太阳宫","崔各庄","三间房");//朝阳区
townArray[1][1][4] = new Array("请选择","平谷镇","峪口镇","马坊镇","金海湖镇",
"东高村镇","山东庄镇","南独乐河镇","大华山镇","夏各庄镇","马昌营镇","王辛庄镇");//平谷区
townArray[1][1][5] = new Array("请选择","南口镇","阳坊镇","十三陵镇","南邵镇",
"兴寿镇","百善镇","沙河镇","东小口镇","北七家镇");//昌平区
townArray[1][1][6] = new Array("请选择","青云店镇","长子营镇","采育镇","礼贤镇",
    "榆垡镇","清源街道","魏善庄镇","林校路街道");//大兴区
townArray[1][1][7] = new Array("请选择","青云店镇","长子营镇","采育镇","礼贤镇",
    "榆垡镇","清源街道","魏善庄镇","林校路街道");//房山区
townArray[1][1][8] = new Array("请选择","平谷镇","峪口镇","马坊镇","金海湖镇",
    "东高村镇","山东庄镇","南独乐河镇","大华山镇","夏各庄镇","马昌营镇","王辛庄镇");//密云区

//district of Tianjin
townArray[2][0][0] = new Array("请选择");
townArray[2][1][0] = new Array("请选择");
townArray[2][1][1] = new Array("请选择","劝业场街道","小白楼街道","五大道街道","新兴街道",
"南营门街道","南市街道");//和平区
townArray[2][1][2] = new Array("请选择","月川社区","榕根社区	","榕根社区	","鹿回头社区",
    "港门村社区","下洋田社区","荔枝沟社区","清平乐社区");//河东区
townArray[2][1][3] = new Array("请选择","大营门街道","下瓦房街道","桃园街道","挂甲寺街道",
    "马场街道","越秀路街道","尖山街道","陈塘庄街道");//河西区
townArray[2][1][4] = new Array("请选择","长虹街道","鼓楼街道","兴南街道","广开街道",
    "万兴街道","学府街道","向阳路街道","嘉陵道街道");//南开区
townArray[2][1][5] = new Array("请选择","光复道街道","望海楼街道","新开河街道","铁东路街道",
    "建昌道街道","宁园街道","江都路街道","月牙河街道");//河北区
townArray[2][1][6] = new Array("请选择","长虹街道","鼓楼街道","兴南街道","广开街道",
    "万兴街道","学府街道","向阳路街道","嘉陵道街道");//滨海新区
townArray[2][1][7] = new Array("请选择","月川社区","榕根社区","榕根社区","鹿回头社区",
    "港门村社区","下洋田社区","荔枝沟社区","清平乐社区");//东丽区
townArray[2][1][8] = new Array("请选择","大营门街道","下瓦房街道","桃园街道","挂甲寺街道",
"马场街道","越秀路街道","尖山街道","陈塘庄街道");//红桥区
//district of shanghai
townArray[3][0][0] = new Array("请选择");
townArray[3][1][0] = new Array("请选择");
townArray[3][1][1] = new Array("请选择","南京东路街道","外滩街道","半淞园路街道","小东门街道",
    "豫园街道","老西门街道","瑞金二路街道","淮海中路街道");//黄埔区
townArray[3][1][2] = new Array("请选择","湖南路街道","天平路街道","枫林路街道","徐家汇街道",
    "斜土路街道","龙华街道","瑞金二路街道","虹梅路街道");//徐汇区
townArray[3][1][3] = new Array("请选择","华阳路街道","新华路街道","江苏路街道","天山路街道",
    "周家桥街道","虹桥街道","仙霞新村街道","程家桥街道");//长宁区
townArray[3][1][4] = new Array("请选择","江宁路街道","静安寺街道","南京西路街道","曹家渡街道",
    "石门二路街道","天目西路街道","北站街道","程家桥街道");//静安区
townArray[3][1][5] = new Array("请选择","湖南路街道","天平路街道","枫林路街道","徐家汇街道",
    "斜土路街道","龙华街道","瑞金二路街道","虹梅路街道");//普陀区
townArray[3][1][6] = new Array("请选择","南京东路街道","外滩街道","半淞园路街道","小东门街道",
    "豫园街道","老西门街道","瑞金二路街道","淮海中路街道");//虹口区
townArray[3][1][7] = new Array("请选择","湖南路街道","天平路街道","枫林路街道","徐家汇街道",
    "斜土路街道","龙华街道","瑞金二路街道","虹梅路街道");//浦东新区
townArray[3][1][8] = new Array("请选择","华阳路街道","新华路街道","江苏路街道","天山路街道",
    "周家桥街道","虹桥街道","仙霞新村街道","程家桥街道");//闵行区
